=begin
Прямоугольный треугольник. Программа запрашивает у пользователя 3 стороны треу
гольника и определяет, является ли треугольник прямоугольным (используя теорему
Пифагора www-formula.ru), равнобедренным (т.е. у него равны любые 2 стороны)  или
равносторонним (все 3 стороны равны) и выводит результат на экран. Подсказка: чтобы
воспользоваться теоремой Пифагора, нужно сначала найти самую длинную сторону (гипотенуза)
и сравнить ее значение в квадрате с суммой квадратов двух остальных сторон. Если все
3 стороны равны, то треугольник равнобедренный и равносторонний, но не прямоугольный.
=end


  puts "Введите первую сторону треуголька"
  a = gets.chomp.to_i
  puts "Введите вторую сторону треугольника"
  b = gets.chomp.to_i
  puts "Введите третью сторону треугольника"
  c = gets.chomp.to_i

if a**2 + b**2 == c**2 || b**2 + c**2 == a**2 || a**2 + c**2 == b**2
  puts "Ваш треугольник прямоугольный"
elsif a == b && a == c
  puts "Ваш труегольник равнобедренный"
elsif a == b && a == c && b == c
  puts "Ваш треугольник равносторонний"
else
  puts "ваш треугольник обычный"
end
